{"backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [5, 5], "activation": "relu", "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_38", "trainable": true, "filters": 32, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [4, 4], "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_39", "trainable": true, "filters": 32, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_19", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_24", "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_40", "trainable": true, "filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_41", "trainable": true, "filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_20", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_25", "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_42", "trainable": true, "filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_43", "trainable": true, "filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_21", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_26", "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_9", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "units": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_23", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "units": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_24", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_27", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "units": 10, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_25", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}]}